
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ОбъектОбработки().ПолучитьНастройки();
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "ГруппаПользователей");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "КаталогВыгрузки");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "ПроизводительБренд");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "ВиртуальныйТПКод");
	
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "FTPАдресСервера");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "FTPЛогин");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "FTPПароль");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "FTPТаймаут");
	ЗаполнитьРеквизитФормыИзНатроек(Настройки, "FTPПорт");
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы 
//	
//#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачальноеЗаполнение(Команда)
	НачальноеЗаполнениеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	ВыгрузитьДанныеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеквизитФормыИзНатроек(Настройки, ИмяРеквизита)

	Если Настройки.Свойство(ИмяРеквизита) Тогда
		ЭтотОбъект[ИмяРеквизита] = Настройки[ИмяРеквизита];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнениеНаСервере() 
	
	ОбъектОбработки().НачальноеЗаполнение();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	КлючОбъекта = "SalesWorks";
	КлючНастроек = "НастройкиSalesWorks";
	ИмяПользователя = "Администратор";
	
	Настройки = Новый Структура;
	Настройки.Вставить("КаталогВыгрузки", КаталогВыгрузки); 
	Настройки.Вставить("ГруппаПользователей", ГруппаПользователей);
	Настройки.Вставить("ПроизводительБренд", ПроизводительБренд);
	Настройки.Вставить("ВиртуальныйТПКод", ВиртуальныйТПКод);
	Настройки.Вставить("FTPАдресСервера", FTPАдресСервера);
	Настройки.Вставить("FTPПорт", FTPПорт);
	Настройки.Вставить("FTPЛогин", FTPЛогин);
	Настройки.Вставить("FTPПароль", FTPПароль);
	Настройки.Вставить("FTPТаймаут", FTPТаймаут);
	Настройки.Вставить("FTPВыгружать", FTPВыгружать);
	Настройки.Вставить("ВидЦены", ВидЦены);
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);
	
КонецПроцедуры 

&НаСервере
Функция ОбъектОбработки()

	Возврат РеквизитФормыВЗначение("Объект");
	
КонецФункции 

&НаСервере
Процедура ВыгрузитьДанныеНаСервере()

	ОбъектОбработки().ВыгрузитьВсеДанные();
	
КонецПроцедуры

#КонецОбласти